//# 왜 참여하게 되었나요?

//& 타입스크립트 문외한으로서, 취업시장에 도전장을 내미기에는 너무 부족하다고 생각했습니다.
//& 타입스크립트에 대한 막연한 두려움도 있었고, 인터넷 강의를 사놓고 보지않는 제 자신을 발견하기도 했습니다.
//& 그러던 중, 타입스크립트 챌린지라는 좋은 기회가 생겨서 이번 기회에는 꼭 타입스크립트를 숙지해보자는 마음으로 참여하게 되었습니다.

//# 참여하면서 어떤 점이 가장 즐거웠나요?

//& 이해하기 쉬운 강의 덕분에 타입스크립트에 대한 두려움이 사라지게되었습니다. (물론, 아직 많이 부족해서 회독이 필요한 상황인 것 같지만요,,)
//& 챌린지를 완주했다는 성취감이 있었습니다.

//# 참여하면서 어떤 점이 가장 아쉬웠나요?

//& 매일 들어야하는 강의와 과제는 적절했다고 생각하지만, 최초에 계획했던 당일 배웠던 내용은 당일에 블로그로 정리하는 것은 어려웠습니다.

//# 챌린지 시작 전과 비교해 나는 어떻게, 얼마나 성장했나요?

//& 실력적인 측면에서는 많이 성장했다고 생각하지 않습니다. 하지만, 타입스크립트에 대한 두려움이 사라졌다는 점에서는 많이 성장했다고 생각합니다.
//& 챌린지 시작 전과는 달리 기존 개인 프로젝트나 새로운 프로젝트에 타입스크립트를 적용해보고 싶은 마음이 생겼습니다.

//# 여러분의 마지막 소감을 남겨주세요

//& 먼저 타입스크립트 챌린지라는 기회를 만들어주신 정환님께 감사인사를 올리고 싶고,
//& 같이 완주해주신 다른 분들이 계셔서 동기부여도 되고 좋았던 것 같습니다.
//& 1번 강의를 완강했다라는 경험으로 타입스크립트를 마스터했다고 하기엔, 워낙 타입스크립트는 넓고 깊기도 하고,
//& 아직 숙지가 덜 된 것도 스스로 잘 알고 있기에, 앞으로도 반복해서 공부해야겠다는 생각이 들었습니다.
//& 다음에도 React나 Next 챌린지 등 다른 챌린지가 있다면 참여해보고 싶습니다.
